Repository: GamemakerChina/GmlSpec-CN
Catalog: omegat/project_save.tmx
Source language: en_us
Languages: zh_cn

source: An edge shape is simply a line that will generate a collision when other fixtures over lap it, and can be very useful for generating (for example) terrain, or for creating borders around a room.
zh_cn: 边缘形状就是当其他固定物覆盖它时会产生碰撞的一条线，这对于生成(例如)地形或创建房间周围的边界非常有用。

source: An ellipse, with the width and height defined by the area.
zh_cn: 一个椭圆，其宽度和高度由面积定义。

source: An elliptical collision mask shape
zh_cn: 椭圆形碰撞遮罩形状

source: An input value that can be string, integer, variable or constant.
zh_cn: 输入值可以是字符串、整数、变量或常量。

source: An instance can be flagged as solid through the object properties in the Object Editor, or by changing the value of this built-in variable.
zh_cn: 通过对象编辑器中的对象属性，或者通过更改此内置变量的值，可以将实例标记为实体。

source: An instance can be flagged as visible or not by setting this variable to true (visible) or false (invisible).
zh_cn: 通过将此变量设置为true(可见)或false(不可见)，可以将实例标记为可见或不可见。

source: An inverse gaussian distribution where more particles are generated at the edges than center.
zh_cn: 一种逆高斯分布，边缘生成的粒子比中心多。

source: An unsigned 64bit integer.
zh_cn: 无符号64位整数。

source: An unsigned, 16bit integer.
zh_cn: 无符号的16位整数。

source: An unsigned, 32bit integer.
zh_cn: 无符号的32位整数。

source: An unsigned, 8bit integer.
zh_cn: 一个无符号的8位整数。

source: Android
zh_cn: 安卓 Android

source: Android tablet
zh_cn: 安卓平板

source: Angles in GameMaker are calculated with 0º to the right, and go anti-clockwise - so 90º is up, 180º is left and 270º is down - and the default angle for a sequence would be 0º.
zh_cn: GameMaker中的角度是向右0º计算的，并且是逆时针方向的——所以90º是向上，180º是向左，270º是向下——序列的默认角度是0º。

source: Animation event that runs every step for objects that use skeletal animations
zh_cn: 动画事件，为使用骨架动画的对象运行每一步

source: Animation event that runs for skeletal animations as assigned in the skeletal animation tool
zh_cn: 动画事件，为骨骼动画工具中指定的骨骼动画运行

source: Another way to use force in the physics world is to apply it locally to an instance.
zh_cn: 在物理世界中使用力的另一种方式是将力局部应用于实例。

source: Any arguments not supplied will use their default arguments.
zh_cn: 任何未提供的参数都将使用其默认参数。

source: Any fixture can be flagged as a sensor, and it makes no difference if the instance it is bound to is static or in movement.
zh_cn: 任何设备都可以被标记为传感器，无论它所绑定到的实例是静态的还是运动的，都没有区别。

source: Any further calls to the sound index after it has been destroyed will give an error.
zh_cn: 在声音索引被销毁后，对它的任何进一步调用都将给出一个错误。

source: Any of the mouse buttons
zh_cn: 任意一个鼠标按钮

source: Any other value (including internal colour constants like c_red, or c_aqua) will blend the specified colour with the original sprite.
zh_cn: 任何其他值(包括内部颜色常量，如c_red或c_aqua)会将指定的颜色与原始精灵混合。

source: Any slots using the attachment will be cleared.
zh_cn: 任何使用附件的插槽都将被清除。

source: Any sounds played on this emitter will be processed by the audio bus.
zh_cn: 在这个发射器上播放的任何声音都将由音频总线处理。

source: Anything else will cause the game to crash with an error message.
zh_cn: 任何其他情况都会导致游戏崩溃并发出错误消息。

source: Anything over 1 can be used but, depending on the sound used and the platform being compiled to, you may get distortion or clipping when the sound is played back.
zh_cn: 可以使用任何大于1的值，但是根据使用的声音和编译的平台，播放声音时可能会失真或音频削波。

source: Archived files
zh_cn: 归档文件

source: Array of skin names defined in the sprite to combine.
zh_cn: 要组合的sprite中定义的皮肤名称数组。

source: Array with the sprite indices to fetch
zh_cn: 包含要提取的精灵索引的数组

source: Array with the sprite indices to flush
zh_cn: 具有要刷新的sprite索引的数组

source: Arrays created in this way will have each entry initialised to 0 unless you specify an (optional) initialisation value.
zh_cn: 以这种方式创建的数组将把每个条目初始化为0，除非你指定了一个(可选的)初始化值。

source: As a result, particles tend to form clusters as they bounce.
zh_cn: 因此，粒子在反弹时往往会形成团簇。

source: As above, only now the menu button is at the top.
zh_cn: 和上面一样，只是现在菜单按钮在顶部。

source: As above, only now the menu button is on the left.
zh_cn: 和上面一样，只是现在菜单按钮在左边。

source: As such, this is the most general of all functions for drawing text and gives a large amount of flexibility when drawing.
zh_cn: 因此，这是所有用于绘制文本的函数中最通用的，并且在绘制时提供了很大的灵活性。

source: As such, you should be careful where you use this and make sure to pause the game or only permit it to be shown in areas of your game where it will not interfere with the game-play.
zh_cn: 因此，你应该小心使用它的地方，确保暂停游戏或只允许它显示在你的游戏中不会干扰游戏玩法的区域。

source: As this is an asynchronous function, GameMaker will not block while waiting for a reply, but will keep on running unless it gets callback information.
zh_cn: 因为这是一个异步函数，所以GameMaker不会在等待回复时阻塞，而是会继续运行，除非它得到回调信息。

source: As with all the physics functions, physics_world_gravity() will only work on an instance if the room has a physics world defined for it in the room editor or using physics_world_create().
zh_cn: 与所有的物理函数一样，只有在房间编辑器中或使用physics_world_create()为房间定义了物理世界时，physics_world_gravity()才会对实例起作用。

source: As with draw_sprite() you can specify a sprite and a sub-image for drawing, then the x / y position in the room for the sprite to be drawn at and finally a width and a height (which must be pixel values).
zh_cn: 与draw_sprite()一样，您可以指定要绘制的sprite和子图像，然后指定sprite在房间中的x / y位置，最后指定宽度和高度(必须是像素值)。

source: As with draw_sprite() you can specify a sprite and a sub-image for drawing, then you must give the relative coordinates within the sprite of the area to select for drawing.
zh_cn: 与draw_sprite()一样，你可以指定一个用于绘图的精灵和子图像，然后你必须在精灵的区域内提供相对坐标来选择绘图。

source: As with draw_surface() you can specify a surface and then the x / y position in the room for the surface to be drawn at and finally a width and a height (which must be pixel values).
zh_cn: 与draw_surface()一样，您可以指定一个表面，然后指定要绘制的表面在房间中的x / y位置，最后指定宽度和高度(必须是像素值)。

source: As with draw_surface() you can specify a surface, but you then need to specify the relative coordinates within the surface of an area to select for drawing.
zh_cn: 与draw_surface()一样，您可以指定一个表面，但随后需要指定要选择进行绘制的区域的表面内的相对坐标。

source: As with other particle functions, you provide a minimum and a maximum value (in steps)and each particle lifespan will be a random number of steps from within the specified range.
zh_cn: 与其他粒子函数一样，您可以提供一个最小值和一个最大值(以步为单位),每个粒子的寿命将是指定范围内的随机步数。

source: As with the function vertex_create_buffer(), this function will create a new vertex buffer, only now the vertex data it stores is copied from the regular buffer that is specified as the source.
zh_cn: 与vertex_create_buffer()函数一样，此函数将创建一个新的顶点缓冲区，只是现在它存储的顶点数据是从指定为源的常规缓冲区复制的。

source: As with the function vertex_create_buffer(), this function will create a new vertex buffer.
zh_cn: 与vertex_create_buffer()函数一样，此函数将创建一个新的顶点缓冲区。

source: Audio Playback event
zh_cn: 音频回放事件

source: Audio Recording event
zh_cn: 录音事件

source: Audio sync groups need to be destroyed when not in use to free up the memory and sound resources associated with them using this function.
zh_cn: 音频同步组在不使用时需要被销毁，以释放通过此函数与之关联的内存和声音资源。

source: Automatic - The bounding box will be calculated automatically, based on the tolerance setting for the sprite
zh_cn: 自动-边界框将自动计算，基于精灵的容差设置

source: Base64 is a commonly used encoding scheme that is often used for any media that needs to be stored or transferred over the internet as text, and renders the output unreadable to the human eye.
zh_cn: Base64是一种常用的编码方案，通常用于需要在互联网上作为文本存储或传输的任何媒体，并使输出无法被人眼读懂。

source: Basically, if you have this set to false, all images being drawn will be drawn 100% opaque, meaning that any transparent, or semi transparent, areas of a sprite or background will be visible as a solid colour.
zh_cn: 基本上，如果你将此设置为false，所有被绘制的图像将被绘制成100%不透明，这意味着精灵或背景的任何透明或半透明区域将以纯色显示。

source: Be careful using this function as if you have any instance setting or bursting or any other action using an emitter associated with this system, you will get an error unless you are using the part_emitter_exists() function to check.
zh_cn: 使用此函数时要小心，因为如果使用与此系统相关的发射器进行任何实例设置或爆破或任何其他操作，则会得到错误，除非使用part_emitter_exists()函数进行检查。

source: Bear in mind that it is up to you to tell it what to do once it gets there, as it won't just stop by itself.
zh_cn: 请记住，一旦它到达那里，就由你来告诉它做什么，因为它不会自己停下来。

source: Bear in mind that the mass is calculated in real world weight (ie:kilograms) and you should always try and keep values realistic for what you are modelling.
zh_cn: 请记住，质量是以真实世界的重量(即:千克)来计算的，您应该始终尝试保持您正在建模的值的真实性。

source: Bear in mind that the position is based on the window, not the canvas, (0,0) position and that the sprite must be referenced directly from the texture page (see: sprite_get_tpe()).
zh_cn: 记住，位置是基于窗口，而不是画布(0,0)的位置，精灵必须直接从纹理页面引用(参见:sprite_get_tpe())。

source: Before this event is fired GM will show an error message in the UI.
zh_cn: 在此事件触发之前，GM将在UI中显示一条错误消息。

source: Before you can define your new vertex format you must tell GameMaker that you're doing so using this function.
zh_cn: 在你定义新的顶点格式之前，你必须告诉GameMaker你正在使用此函数。

source: Begin Step
zh_cn: 步开始 Begin Step

source: Below is an image that shows how this function works:
zh_cn: 下图显示了此函数是如何工作的:

source: Below you can see an example of a sprite that has been blended with different colours:
zh_cn: 下面你可以看到一个混合了不同颜色的精灵的例子:

source: Below you can see an image of how these components look when separated:
zh_cn: 下图显示了这些组件分开后的样子:

source: Between 0 (start) and 1 (end), can be decimal.
zh_cn: 在0(开始)和1(结束)之间，可以是小数。

source: Between 0 (start) and 1 (end).
zh_cn: 介于0(开始)和1(结束)之间。

source: Both can be very handy, some games prefer to display a score as a set number of digits, while control over decimal places can be good for a high accuracy the two decimal places of string() cannot provide.
zh_cn: 两者都可以非常方便，一些游戏更喜欢将分数显示为一组数字，而对小数位数的控制可以很好地实现string()的两个小数位数所不能提供的高精度。

source: Both grids must have been created previously using the ds_grid_create() function.
zh_cn: 两个网格必须在之前使用ds_grid_create()函数创建。

source: Both lists must have been created previously and if the list being copied to already has information within it, this list will be cleared first.
zh_cn: 这两个列表都必须是以前创建的，如果要复制到的列表中已经有信息，该列表将首先被清除。

source: Both the buffer being read from and the surface being written to must have been created previously, and you can provide an offset into the buffer to start reading from.
zh_cn: 被读取的缓冲区和被写入的表面都必须是以前创建的，并且可以向缓冲区提供一个开始读取的偏移量。

source: Broadcast Message event used for sprites and sequences
zh_cn: 用于精灵和序列的广播消息事件

source: By default AA is enabled.
zh_cn: 缺省情况下，AA是开启的。

source: By default all colour writing is set to true:
zh_cn: 默认情况下，所有彩色书写设置为true:

source: By default the application surface is enabled and all drawing for the Draw events will be done to that and the surface drawn to the screen.
zh_cn: 默认情况下，应用程序表面是启用的，绘制事件的所有绘制都将在该表面上完成，并绘制到屏幕上。

source: By default the cross origin type is set to "anonymous".
zh_cn: 缺省情况下，跨域类型为"匿名"。

source: By default this is disabled.
zh_cn: 默认情况下，这是禁用的。

source: By default this is enabled, but in many cases you will want to take over when and how the surface is drawn (when using shaders for example), in which case you would use this function to set it to false so that you can draw it yourself when and how you require.
zh_cn: 默认情况下，这是启用的，但在许多情况下，您会希望接管绘制表面的时间和方式(例如，当使用着色器时)，在这种情况下，您可以使用此函数将其设置为false，以便您可以在需要的时间和方式自己绘制表面。

source: By default this is on and so the function will return true
zh_cn: 默认情况下，这是打开的，因此函数将返回true

source: By default this is set to true, meaning that every time the user taps the device screen twice quickly and consecutively, the return value is the same as if the right mouse button had been clicked.
zh_cn: 默认情况下，这被设置为true，这意味着每当用户快速连续两次点击设备屏幕时，返回值与点击鼠标右键时相同。

source: By default this position is always (0,0), but in some very special circumstances you may wish to change this to something else.
zh_cn: 默认情况下，该位置总是(0,0)，但在某些非常特殊的情况下，您可能希望将其更改为其他位置。

source: By setting this function to false you can disable the power saving features and ensure that the screen (and game) are always functioning.
zh_cn: 通过将此函数设置为false，您可以禁用省电功能，并确保屏幕(和游戏)始终正常运行。

source: By switching alpha testing on you can then use the companion function gpu_set_alphatestref() to set the "cut-off" value at which all alpha values will be set to 0.
zh_cn: 通过打开alpha测试，您可以使用附带的函数gpu_set_alphatestref()来设置"截止"值，在这个值处所有透明度(Alpha)值都将被设置为0。

source: By using a series of predefined constants, you can ask GameMaker to tell you a number of things about the state of any given joint.
zh_cn: 通过使用一系列预定义的常量，你可以要求GameMaker告诉你关于任何给定关节状态的一些事情。

source: By using an empty string as the new extension you can remove the extension part all together.
zh_cn: 通过使用一个空字符串作为新的扩展名，您可以一起删除扩展名部分。

source: Calling the function with no arguments will simply destroy the instance that is currently in scope and running the code, but you can provide an optional "id" argument and target a specific instance by using the instance id value, or you can target all instances of a particular object by using an object_index.
zh_cn: 调用不带参数的函数将简单地销毁当前在作用域中并运行代码的实例，但是您可以提供一个可选的"id"参数，并通过使用实例id值锁定特定实例，或者通过使用object_index锁定特定对象的所有实例。

source: Calling the function with true as the argument enables it and using false disables it (not recommended).
zh_cn: 调用参数为true的函数时启用它，而使用false时禁用它(不推荐)。

source: Calling this function after disabling the garbage collector (using the function gc_enable()) will enable the garbage collector for one frame in which all objects that have been flagged for collection will be removed from memory before the garbage collector is disabled again.
zh_cn: 在禁用垃圾收集器后调用此函数(使用函数gc_enable())将启用垃圾收集器的一帧，在此帧中所有标记为收集的对象将从内存中删除，然后再次禁用垃圾收集器。

source: Calling this function will create the particles within the given shape parameters, and also return an ID value which can be stored and used in further functions for interactions with the particle group.
zh_cn: 调用此函数将在给定的形状参数内创建粒子，并返回一个ID值，该值可被存储并在与粒子组交互的其他函数中使用。

source: Calling this function will end the current path that the instance is following, as set when the function path_start() was called..
zh_cn: 调用此函数将结束实例所遵循的当前路径，该路径是在调用函数path_start()时设置的..

source: Calling this function will generate a System Asynchronous Event, in which the async_load DS map will be populated with the following key/value pairs:
zh_cn: 调用此函数将生成一个系统异步事件，其中async_load DS映射将用以下键/值对填充:

source: Calling this function will remove the animation curve from memory and clean up any channels or points that it contains as well (these never need to be cleaned up manually).
zh_cn: 调用此函数将从内存中删除动画曲线，并清除其中包含的任何通道或点(这些永远不需要手动清除)。

source: Can be an object index, an instance id or the special keyword ,all
zh_cn: 可以是对象索引、实例id或特殊关键字all

source: Can be an object index, an instance id or the special keyword ,all.
zh_cn: 可以是对象索引、实例id或特殊关键字。

source: Can be an object index, an instance id or the special keyword, all
zh_cn: 可以是对象索引、实例id或特殊关键字all

source: Can be either true or false or omitted completely.
zh_cn: 可以是 true 或 false，也可以完全省略。

source: Can only be either 1 or 0 (true or false)
zh_cn: 只能是1或0(真或假)

source: Can only be used with buffer_u8 data types, and must be 1 byte aligned.
zh_cn: 只能用于buffer_u8数据类型，并且必须1字节对齐。

source: Cancels a delayed call set up by call_later.
zh_cn: 取消由call_later设置的延迟调用。

source: Care should be taken when doing this as if the index you change the variable to is not valid the game will throw an error and close.
zh_cn: 这样做的时候要小心，如果你改变变量的索引无效，游戏会抛出一个错误并关闭。

source: Care should be taken with persistence as it is easy to lose track of persistent instances which can lead to problems later in the development of the game.
zh_cn: 应该注意持久性，因为很容易失去对持久性实例的跟踪，这可能会在游戏开发的后期导致问题。

source: Care should be taken with this function as one common mistake is to use it round up a random value and expect it always to be greater than 1, ie:
zh_cn: 在使用此函数时应该小心，因为一个常见的错误是使用它四舍五入一个随机值，并期望它总是大于1，例如:

source: Cells are not calculated as room coordinates, but rather as grid coordinates, where (0,0) is the top let corner of the grid.
zh_cn: 单元不是作为房间坐标计算的，而是作为网格坐标计算的，其中(0，0)是网格的左上角。

source: Certain joint properties can be changed and set even after the creation of the joint.
zh_cn: 即使在创建了关节之后，某些关节属性也可以更改和设置。

source: Certain target platforms permit more than one listener, so it is important that you know how many the target has before changing or using different listeners.
zh_cn: 某些目标平台允许多个侦听器，因此在更改或使用不同的侦听器之前，了解目标平台有多少个侦听器是很重要的。

source: Change the instance from static to kinematic mid-simulation can be expensive in terms of processing (depending on the state of the instances in the physics world) and therefore it is recommended to set the fixture to be kinematic using this function prior to binding it to an instance, so that it will be unaffected by collisions and forces (such as gravity) but may move with constant linear and/or angular velocity.
zh_cn: 从处理的角度来看，将实例从静态更改为动态中间模拟的成本可能很高(取决于物理世界中实例的状态)，因此建议在将夹具绑定到实例之前，通过此函数将夹具设置为动态的，这样它将不受碰撞和力(如重力)的影响，但可以以恒定的线速度和/或角速度移动。

source: Changing the sprite does not change the index of the currently visible frame, so if you change the sprite on frame number 3, the new sprite will be drawn with that frame visible (assuming it has the same number of frames).
zh_cn: 改变精灵并不会改变当前可见帧的索引，所以如果你改变了第3帧上的精灵，新的精灵就会以该帧可见的方式绘制出来(假设它有相同的帧数)。

source: Changing these values does not modify the resource in any way (only how it is drawn), and you can use any of the available sprite variables instead of direct values for all the arguments in the function.
zh_cn: 改变这些值并不会以任何方式修改资源(只是如何绘制)，你可以使用任何可用的精灵变量而不是函数中所有参数的直接值。

source: Changing these values does not modify the resource in any way (only how it is drawn).
zh_cn: 更改这些值不会以任何方式修改资源(只会修改资源的绘制方式)。

source: Clean Up Event
zh_cn: 清理事件 Clean Up Event

source: Closes a previously opened binary file.
zh_cn: 关闭先前打开的二进制文件。

source: Cloud event
zh_cn: 云事件

source: Collision with an object
zh_cn: 与物体碰撞

source: Collision_circle creates a circular zone of the radius given by the user around the points x1,y1 and then checks that zone for a collision with any instance of the object specified by the argument "obj".
zh_cn: Collision_circle围绕点x1、y1创建一个半径由用户指定的圆形区域，然后检查该区域是否与参数"obj"指定的对象的任何实例发生碰撞。

source: Collision_ellipse uses the first four arguments (x1,y1,x2,y2) to define the width and height of an ellipse within the current room and then checks to see if any object that is defined by the "obj" argument is in collision with that area.
zh_cn: Collision_ellipse使用前四个参数(x1,y1,x2,y2)来定义当前房间内椭圆的宽度和高度，然后检查由"obj"参数定义的任何对象是否与该区域碰撞。

source: Collision_line checks along a line from point x1,y1 to point x2,y2 for a collision with any instance of the object specified by the argument "obj".
zh_cn: Collision_line沿着从点x1，y1到点x2，y2的直线检查与由参数"obj"指定的对象的任何实例的碰撞。

source: Collision_point checks the point specified by the arguments x1,y1 for a collision with any instance of the object specified by the argument "obj".
zh_cn: Collision_point检查由参数x1、y1指定的点是否与由参数"obj"指定的对象的任何实例发生碰撞。

source: Collision_rectangle uses the first four arguments (x1,y1,x2,y2) to define an area within the current room and then checks to see if any object that is defined by the "obj" argument is in collision with that area.
zh_cn: Collision_rectangle使用前四个参数(x1，y1，x2，y2)来定义当前房间内的一个区域，然后检查由"obj"参数定义的任何对象是否与该区域碰撞。

source: Collisions are based on the mask of the instances, and if any part of the mask over-laps with the target point it then the function will destroy that instance.
zh_cn: 碰撞基于实例的遮罩，如果遮罩的任何部分与目标点重叠，则此函数将破坏该实例。

source: Colour-mixing particles take on some of the colour of other particles with which they collide.
zh_cn: 混色粒子呈现出与它们碰撞的其他粒子的一些颜色。

source: Command-line parameters are those extra commands that you can add to an exe to change how the program is run and with this function you can get the chosen command-line parameter as a string.
zh_cn: 命令行参数是那些额外的命令，你可以添加到一个exe来改变程序的运行方式，通过此函数，你可以得到一个字符串形式的命令行参数。

source: Command-line parameters are those extra commands that you can add to an exe to change how the program is run.
zh_cn: 命令行参数是那些可以添加到exe中以改变程序运行方式的额外命令。

source: Consider this image:
zh_cn: 看看这张图片:

source: Continue from the current position
zh_cn: 从当前位置继续

source: Continue the path from the start, jumping to the start position again if the path is not closed
zh_cn: 从起点继续该路径，如果路径没有关闭，则再次跳到起点位置

source: Converts a frequency in beats-per-minute to its equivalent period in seconds.
zh_cn: 将频率(以每分钟为单位)转换为其等效周期(以秒为单位)。

source: Converts a period in seconds to its equivalent frequency in beats-per-minute.
zh_cn: 将以秒为单位的周期转换为以拍每分钟为单位的等效频率。

source: Create a Bluetooth socket (currently unavailable!).
zh_cn: 创建一个蓝牙套接字(目前不可用!)

source: Create a socket using TCP.
zh_cn: 使用TCP创建套接字。

source: Create a socket using UDP.
zh_cn: 使用UDP创建套接字。

source: Create a web socket (only for connecting to HTML5 projects), using TCP.
zh_cn: 使用TCP创建一个web套接字(仅用于连接到HTML5项目)。

source: Create event
zh_cn: 创建事件 Create event

source: Creates a new skin by combining one or more skins defined in the sprite.
zh_cn: 通过组合sprite中定义的一个或多个外观来创建新的皮肤。

source: Creates a new time source, returning its index.
zh_cn: 创建新的时间源，返回其索引。

source: Creates a sync group and returns a unique ID value for it which should then be used in all further audio function calls for this group.
zh_cn: 创建一个同步组并为它返回一个唯一的ID值，然后该ID值将用于该组的所有后续音频函数调用。

source: D-pad down
zh_cn: D-pad 下

source: D-pad left
zh_cn: D-pad 左

source: D-pad right
zh_cn: D-pad 右

source: D-pad up
zh_cn: D-pad 上

source: DS maps take up space in memory, which is allocated to them when they are created.
zh_cn: DS map占用内存空间，这些空间是在创建它们时分配给它们的。

source: DS maps are not stored in a linear form, for that use DS list, so all this does is find the first key as stored by the computer.
zh_cn: DS map不是以线性形式存储的，因此使用DS列表，这样做只是找到计算机存储的第一个键。

source: DS maps are not stored in a linear form, for that use DS lists, so all this does is find the last key as stored by the computer.
zh_cn: DS map不是以线性形式存储的，因为它使用了DS列表，所以所有这些只是找到计算机存储的最后一个键。

source: Damping is also much cheaper to simulate than friction, but please note that damping is not a replacement for friction; the two effects can, and should, be used together.
zh_cn: 阻尼的模拟成本也比摩擦低得多，但注意，阻尼不是摩擦的替代品;这两种效果可以，也应该一起使用。

source: Damping is used to reduce the physics simulation velocity of instances over time, much like air resistance in the real world.
zh_cn: 阻尼用于随着时间的推移降低实例的物理模拟速度，就像现实世界中的空气阻力一样。

source: Damping is used to reduce the physics world velocity of instances, and differs from friction in that friction only occurs when two instances with fixtures are in contact.
zh_cn: 阻尼用于降低实例的物理世界速度，与摩擦不同的是，摩擦仅在两个带有夹具的实例接触时发生。

source: Damping parameters should be between 0 and infinity, with 0 meaning no damping, and infinity meaning full damping.
zh_cn: 阻尼参数应该在0到无穷大之间，0表示无阻尼，无穷大表示有阻尼。

source: Default is 0 (unless set in the room editor).
zh_cn: 默认值为0(除非在房间编辑器中设置)。

source: Default is 0.
zh_cn: 默认值为0。

source: Default is 4.
zh_cn: 默认值为4。

source: Default is disabled (false).
zh_cn: 默认为禁用(false)。

source: Default player preferences
zh_cn: 默认玩家偏好

source: Default scale is 1.
zh_cn: 默认缩放值为1。

source: Default value is 1.
zh_cn: 默认值为1。

source: Default value is true.
zh_cn: 默认值为true。

source: Defaults to 0.
zh_cn: 默认值为0。

source: Defaults to array[offset], if ommitted first iteration will be skipped.
zh_cn: 默认为数组[offset]，如果省略第一次迭代将被跳过。

source: Defaults to array_length() - 1.
zh_cn: 默认为array_length() - 1。

source: Describes the script where this exception came from.
zh_cn: 描述引发此异常的脚本。

source: Destination blend mode factor (see constants above)
zh_cn: 目标混合模式乘数(参见上面的常量)

source: Destination blend mode factor Alpha (see constants above)
zh_cn: 目标混合模式乘数Alpha(见上面的常量)

source: Destination blend mode factor for RGB(see constants above)
zh_cn: RGB的目标混合模式乘数(参见上面的常量)

source: Destroy event
zh_cn: 销毁事件 Destroy event

source: Destroys the time source, as long as it has no children.
zh_cn: 破坏时间源，只要它没有子级。

source: Determines how/if the words typed via the virtual keyboard will be autocapitalized.
zh_cn: 确定通过虚拟键盘键入的单词将如何/是否自动大写。

source: Determines the keyset available on the virtual keyboard.
zh_cn: 确定虚拟键盘上可用的按键集。

source: Determines what is shown on the return/action key of the virtual keyboard.
zh_cn: 确定虚拟键盘的return/action键上显示的内容。
